Repository: alexboia/LivePayments-MP-WC
Catalog: lang/livepayments-mp-wc-*.po
Languages: ro_ro

source: LivePayments is a Credit & Debit Card WooCommerce Payment Gateway that uses the Romanian mobilPay payment processor.
ro_ro: LivePayments este un gateway de plată prin card de credit și debit, pentru WooCommerce, care se integrează cu procesatorul mobilPay

source: Transaction Id
ro_ro: ID tranzacție

source: Transaction status
ro_ro: Status tranzacție

source: Card number
ro_ro: Număr de card

source: Original amount
ro_ro: Suma originală

source: Actually processed amount
ro_ro: Suma efectiv procesată

source: Date initiated
ro_ro: Data inițierii

source: Date of last activity
ro_ro: Data ultimei activități

source: Transaction error code
ro_ro: Codul de eroare al tranzacției

source: Transaction error message
ro_ro: Mesajul de eroare al tranzacției

source: Client IP Address
ro_ro: Adresa de IP a clientului

source: Card has a risk (i.e. stolen card)
ro_ro: Card cu risc (de ex. card furat)

source: Card number is incorrect
ro_ro: Numărul cardului este incorect

source: Closed card
ro_ro: Card închis

source: Card is expired
ro_ro: Cardul este expirat

source: Insufficient funds
ro_ro: Fonduri insuficiente

source: CVV2 code incorrect
ro_ro: Codul CVV2 este incorect

source: Issuer is unavailable
ro_ro: Emitentul nu este disponibil

source: Amount is incorrect
ro_ro: Suma incorectă

source: Currency is incorrect
ro_ro: Valuta incorectă

source: Transaction not permitted to cardholder
ro_ro: Deținătorului cardului nu-i este permisă tranzacția

source: Transaction declined
ro_ro: Tranzacție refuzată

source: Transaction rejected by antifraud filters
ro_ro: Tranzacția respinsă de filtrele anti-fraudă

source: Transaction declined (breaking the law)
ro_ro: Tranzacție respinsă (potențial ilegală)

source: Invalid request
ro_ro: Cerere invalidă

source: Duplicate PREAUTH
ro_ro: Operațiune PREAUTH redundantă

source: Duplicate AUTH
ro_ro: Operațiune AUTH redundantă

source: You can only CANCEL a preauth order
ro_ro: Se poate anula doar o comandă preautorizată

source: You can only CONFIRM a preauth order
ro_ro: Poate fi confirmată doar o comandă preautorizată

source: You can only CREDIT a confirmed order
ro_ro: Poate fi creditată doar o comandă confirmată

source: Credit amount is higher than auth amount
ro_ro: Suma creditată este mai mare decât suma inițial autorizată

source: Capture amount is higher than preauth amount
ro_ro: Suma capturată este mai mare decât suma inițial preautorizată

source: Duplicate request
ro_ro: Cerere redundantă

source: Generic error
ro_ro: Eroare generică

source: The amount you paid has been refuned. The order has been marked as refunded as well. Transaction id: %s
ro_ro: Suma plătită ți-a fost rambursată. Comanda a fost marcată drept rambursată. ID Tranzacție: %s.

source: The paid amount has been refuned. The order has been marked as refunded as well. Transaction id: %s
ro_ro: Suma plătită a fost rambursată. Comanda a fost marcată drept rambursată. ID Tranzacție: %s.

source: The paid amount has been refuned. The order has been marked as refunded as well.
ro_ro: Suma plătită a fost rambursată. Comanda a fost marcată drept rambursată.

source: Partial refund notification received from MobilPay gateway. Transaction id: %s
ro_ro: Notificare de rambursare parțială primită de la gateway-ul MobilPay. ID tranzacție: %s.

source: The payment has been cancelled. The order has been cancelled as well. Transaction id: %s
ro_ro: Plata a fost anulată. Comanda a fost de asemenea marcată drept anulată. ID tranzacție: %s.

source: Your payment has been cancelled. The order has been cancelled as well. Transaction id: %s
ro_ro: Plata ta a fost anulată. Comanda a fost de asemenea marcată drept anulată. ID tranzacție: %s.

source: Your payment has been cancelled. The order has been cancelled as well.
ro_ro: Plata ta a fost anulată. Comanda a fost de asemenea marcată drept anulată.

source: Order payment is currently being processed. The order has been placed on-hold. Transaction id: %s
ro_ro: Plata este în procesare. Comanda a fost plasată în așteptare. ID tranzacție: %s.

source: Your payment is currently being processed. Your order has been placed on-hold. Transaction id: %s
ro_ro: Plata ta este în procesare. Comanda a fost plasată în așteptare. ID tranzacție: %s.

source: Your payment is currently being processed and the order has been placed on-hold
ro_ro: Plata ta este în procesare. Comanda a fost plasată în așteptare.

source: The order has been placed on hold as the processed amount is smaller than the total order amount (%s vs. %s). Transaction id: %s
ro_ro: Comanda a fost plasată în așteptare deoarece suma procesată este mai mică decât suma totală a comenzii (%s vs. %s). ID tranzacție: %s.

source: The order has been placed on hold as the processed amount is smaller than the total order amount (%s RON vs. %s RON). Transaction id: %s
ro_ro: Comanda a fost plasată în așteptare deoarece suma procesată este mai mică decât suma totală a comenzii (%s RON vs. %s RON). ID tranzacție: %s.

source: The order has been placed on hold as the processed amount is smaller than the total order amount
ro_ro: Comanda a fost plasată în așteptare deoarece suma procesată este mai mică decât suma totală a comenzii.

source: Error processing payment: %s (code: %s). Transaction id: %s
ro_ro: Eroare la procesarea plății: %s (cod eroare: %s). ID tranzacție: %s.

source: The payment has failed. See order notes for additional details
ro_ro: Plata a eșuat. Vezi jurnalul comenzii pentru detalii suplimentare.

source: Your payment has been successfully received. Your order is now completed. Transaction id: %s
ro_ro: Plata ta a fost efectuată și procesată cu succes. Comanda a fost finalizată. ID tranzacție: %s.

source: The payment has been successfully received. The order is now completed. Transaction id: %s
ro_ro: Plata a fost efectuată și procesată cu succes. Comanda a fost finalizată. ID tranzacție: %s.

source: The payment has been successfully received. The order is now completed
ro_ro: Plata a fost efectuată și procesată cu succes. Comanda a fost finalizată.

source: Your payment has been successfully received. Your order is currently being processed. Transaction id: %s
ro_ro: Plata ta a fost efectuată și procesată cu succes. Comanda este în procesare. ID tranzacție: %s.

source: The payment has been successfully received. The order is currently being processed. Transaction id: %s
ro_ro: Plata a fost efectuată și procesată cu succes. Comanda este în procesare. ID tranzacție: %s.

source: The payment has been successfully received. The order is currently being processed.
ro_ro: Plata a fost efectuată și procesată cu succes. Comanda este în procesare.

source: LivePayments - mobilPay Payment Gateway for WooCommerce
ro_ro: LivePayments - Gateway de plată pentru WooCommerce via mobilPay

source: Enable / Disable
ro_ro: Activează / Dezactivează

source: Enable this payment gateway
ro_ro: Activează acest gateway de plată

source: mobilPay&trade; Sandbox / Test Mode
ro_ro: mobilPay&trade; Sandbox / Mod testare

source: Enable Test Mode
ro_ro: Activează modul de testare

source: Place the payment gateway in test mode.
ro_ro: Plasează gateway-ul de plată în modul de testare

source: Title
ro_ro: Titlu

source: Payment title the customer will see during the checkout process.
ro_ro: Titlul afișat clientului în timpul procesului de finalizare a comenzii

source: Description
ro_ro: Descriere

source: Payment description the customer will see during the checkout process.
ro_ro: Descrierea afișată clientului în timpul procesului de finalizare a comenzii

source: Seller Account ID
ro_ro: Identificator cont comerciant

source: This is Account ID provided by MobilPay when you signed up for an account. Unique key for your seller account for the payment process.
ro_ro: Acest identificator este furnizat de MobilPay la înregistrarea în sistemul lor. Reprezintă în mod unic contul tău de comerciant folosit în timpul procesului de plată.

source: Return URL
ro_ro: URL înapoiere

source: You must create a new page and in the content field enter the shortcode [lvdwcmc_display_mobilpay_order_status] so that the user can see the message that is returned by the Mobilpay server regarding their transaction. Or any content you want to thank for buying.
ro_ro: Trebuie să creezi o pagină nouă și, în câmpul de conținut,să introduci shortcode-ul [lvdwcmc_display_mobilpay_order_status], pentru ca utilizatorul, redirecționat aici după ce a efectuat plată pe pagina MobilPay, să poată consulta statusul curent al tranzacției. Se poate adăuga orice conținut suplimentar prin care sunt transmise mulțumiri pentru achiziție.

source: mobilPay&trade; digital certificate for the live environment
ro_ro: Certificatul digital mobilPay&trade; pentru mediul de producție

source: The public key used for securing communication with the mobilPay&trade; gateway in the live environment.
ro_ro: Cheia publică folosită pentru securizarea comunicației cu gateway-ul de plată mobilPay&trade;, în mediul de producție

source: allowed file types: %s
ro_ro: tipuri permise de fișiere: %s

source: The private key for the live environment
ro_ro: Cheia privată pentru mediul de producție

source: The private key used for securing communication with the mobilPay&trade; gateway in the live environment.
ro_ro: Cheia privată folosită pentru securizarea comunicației cu gateway-ul de plată mobilPay&trade;, în mediul de producție

source: mobilPay&trade; digital certificate for the sandbox environment
ro_ro: Certificatul digital mobilPay&trade; pentru mediul de testare

source: The public key used for securing communication with the mobilPay&trade; gateway in the sandbox environment (used when "MobilPay Sandbox / Test Mode" is checked).
ro_ro: Cheia publică folosită pentru securizarea comunicației cu gateway-ul de plată mobilPay&trade;, în mediul de testare (folosită atunci când câmpul "mobilPay&trade; Sandbox / Mod testare" este bifat)

source: The private key for the sandbox environment
ro_ro: Cheia privată pentru mediul de testare

source: The private key used for securing communication with the mobilPay&trade; gateway in the sandbox environment (used when "MobilPay Sandbox / Test Mode" is checked).
ro_ro: Cheia privată folosită pentru securizarea comunicației cu gateway-ul de plată mobilPay&trade;, în mediul de producție (folosită atunci când câmpul "mobilPay&trade; Sandbox / Mod testare" este bifat)

source: The %s payment gateway requires further configuration until it can be used to accept payments. The following fields are missing or require your attention:
ro_ro: Gateway-ul de plată nu este complet configurat pentru a putea accepta plăți. Următoarele câmpuri nu sunt completate sau întâmpină alte probleme:

source: The %s payment gateway is configured and ready to use.
ro_ro: Gateway-ul de plată %s este configurat și gata de a procesa tranzacții.

source: Payment asset file successfully removed.
ro_ro: Fișierul a fost șters cu succes.

source: Payment asset file could not be removed.
ro_ro: Fișierul nu a putut fi șters.

source: Thank you for your order
ro_ro: Îți mulțumim pentru comandă

source: The value for the field %s is a valid URL, but no longer corresponds to an existing local page
ro_ro: Valoarea câmpului %s este un URL valid, dar nu mai corespunde unei pagini de pe site-ul tău

source: The value for the field %s is no longer a valid URL
ro_ro: Valoarea câmpului %s nu mai reprezintă un URL valid

source: The payment asset file %s is not a valid public key certificate
ro_ro: Fișierul %s by reprezintă un certificat valid

source: The payment asset file %s is not a valid private key
ro_ro: Fișierul %s nu reprezintă o cheie privată validă

source: The payment asset file %s is empty
ro_ro: Fișierul %s este gol

source: The payment asset file %s was not found
ro_ro: Fișierul %s nu a fost găsit

source: Error initiating MobilPay card payment.
ro_ro: Eroare la inițierea plății prin card via MobilPay

source: Payment for order #%s.
ro_ro: Plata pentru comanda #%s.

source: LivePayments - mobilPay Card WooCommerce Payment Gateway - Gateway diagnostics warning e-mail
ro_ro: LivePayments - Gateway de plată pentru WooCommerce via mobilPay - E-mail de avertizare asupra stării gateway-ului de plată

source: An e-mail sent to a configured e-mail address when the plug-in detects that something is wrong with the gateway configuration.
ro_ro: Un e-mail este trimis la adresa de e-mail configurată atunci cand plug-in-ul detectează ceva în neregulă cu configurația gateway-ului de plată.

source: mobilPay Card Gateway Configuration Warning
ro_ro: Avertizare Gateway de plată prin card via mobilPay.

source: Cancelled
ro_ro: Anulată

source: Confirmed. Payment successful
ro_ro: Confirmată. Plată finalizată cu succes

source: Pending confirmation
ro_ro: Se așteaptă confirmarea

source: Credited
ro_ro: Rambursată

source: Failed
ro_ro: Eșuată

source: Started
ro_ro: Începută

source: Pending payment
ro_ro: Plata în așteptare

source: Could not activate plug-in: activation failure.
ro_ro: Modulul nu a putut fi activat: eroare la activare.

source: Could not activate plug-in: requirements not met.
ro_ro: Modulul nu a putut fi activat: cerințele tehnice nu sunt îndeplinite.

source: Minimum required PHP version is %s.
ro_ro: Versiunea minimă necesară de PHP este %s.

source: Minimum required WordPress version is %s.
ro_ro: Versiunea minimă necesară de WordPress este %s.

source: Mysqli extension was not found on your system or is not fully compatible.
ro_ro: Extensia Mysqli nu a putut fi găsită pe server-ul tău sau există și nu este compatibilă

source: Openssl extension was not found on your system or is not fully compatible.
ro_ro: Extensia Openssl nu a putut fi găsită pe server-ul tău sau există și nu este compatibilă

source: The installation failed.
ro_ro: Instalarea a eșuat

source: Activation error
ro_ro: Eroare la activare

source: LivePayments Card Transactions
ro_ro: Istoric Tranzacții LivePayments

source: LivePayments - mobilPay Card WooCommerce Payment Gateway - Plugin Settings
ro_ro: LivePayments - mobilPay Card WooCommerce Payment Gateway - Configurare Plugin

source: Plugin Settings
ro_ro: Configurare Plugin

source: Gateway Settings
ro_ro: Configurare Gateway

source: LivePayments - mobilPay Card WooCommerce Payment Gateway - Gateway Settings
ro_ro: LivePayments - mobilPay Card WooCommerce Payment Gateway - Configurare Gateway

source: Plugin Diagnostics
ro_ro: Diagnoză plugin

source: LivePayments - mobilPay Card WooCommerce Payment Gateway - Plugin Diagnostics
ro_ro: LivePayments - mobilPay Card WooCommerce Payment Gateway - Diagnoză plugin

source: Payment transaction details
ro_ro: Detalii tranzacție

source: Please fill in a valid e-mail address to which diagnostics warnings will be sent.
ro_ro: Trebuie să introduci adresa de e-mail la care vor fi trimise avertizările referitoare la starea gateway-ului de plată

source: The settings could not be saved. Please try again.
ro_ro: Setările nu au putut fi salvate. Te rugăm să reîncerci.

source: LivePayments Card Transaction Status
ro_ro: Status Tranzacții LivePayments

source: Plugin version
ro_ro: Versiune plugin

source: WordPress version
ro_ro: Versiune WordPRess

source: PHP version
ro_ro: Versiune PHP

source: Could not load transaction details data
ro_ro: Detaliile tranzacției nu au putut fi încărcate

source: Could not load transaction details data due to a possible network issue
ro_ro: Detaliile tranzacției nu au putut fi încărcate din cauza unei probleme de comunicație

source: Reload page
ro_ro: Reîncarcă pagina

source: LivePayments for Mobilpay - Transaction Reporting
ro_ro: LivePayments pentru Mobilpay - Raportare Tranzacții

source: Transactions Status Counts
ro_ro: Statistici Statusuri Tranzacții

source: Last Transaction
ro_ro: Cea mai Nouă Tranzacție

source: Data not found!
ro_ro: Datele nu au fost găsite!

source: No transactions data found
ro_ro: Nu au fost găsite date legate de tranzacții

source: No transactions status counts data found
ro_ro: Nu au fost găsite date legate de statisticile statusurilor tranzacțiilor

source: Error loading data
ro_ro: Eroare la încărcarea datelor

source: The last transaction details data could not be loaded due to an internal server issue. Please try again.
ro_ro: Nu au putut fi încărcate datele cele mai noi tranzacții, din cauza unei probleme interne a server-ului. Te rugăm să reîncerci.

source: The transactions status counts data could not be loaded due to an internal server issue. Please try again.
ro_ro: Nu au putut fi încărcate statisticile statusurilor tranzacțiilor, din cauza unei probleme interne a server-ului. Te rugăm să reîncerci.

source: The selected file is too large. Maximum allowed size is 10MB
ro_ro: Fișierul selectat este prea voluminos. Dimensiunea maximă admisă este de 10 MB.

source: The selected file type is not valid.
ro_ro: Tipul fișierului nu este valid.

source: The file could not be read
ro_ro: Fișierul nu a putut fi citit.

source: The uploader could not be initialized
ro_ro: Componenta de upload nu a putut fi inițializată

source: The file could not be uploaded
ro_ro: Fișierul nu a putut fi încărcat

source: No file was uploaded
ro_ro: Nu a fost încărcat niciun fișier

source: The file could not be uploaded due to a possible internal server issue
ro_ro: Fișierul nu a putut fi încărcat din cauza unei posibile probleme interne

source: Remove asset file? This action cannot be undone and you will have to re-upload the asset again!
ro_ro: Sigur ștergi fișierul? Această operațiune este definitivă și va trebui să reîncarci fișierul!

source: The asset file could not be removed
ro_ro: Fișierul nu a putut fi șters

source: The asset file could not be removed due to a possible network issue
ro_ro: Fișierul nu a putut fi șters din cauza unei posibile probleme de comunicație

source: The file has been successfully uploaded
ro_ro: Fișierul a fost încărcat cu succes

source: The file has been successfulyl removed
ro_ro: Fișierul a fost șters cu succes

source: The return URL has been successfully generated.
ro_ro: URL-ul de înapoiere a fost generat cu succes

source: The return URL could not generated.
ro_ro: URL-ul de înapoiere nu a putut fi generat.

source: The return URL could not be generated due to a possible network issue
ro_ro: URL-ul de înapoiere nu a putut fi generat din cauza unei posibile probleme de comunicație.

source: The settings have been successfully saved.
ro_ro: Setările au fost salvate cu succes.

source: Please wait...
ro_ro: Te rugăm să aștepți...

source: Your payment could not be processed or has been cancelled.
ro_ro: Plata ta nu a putut fi procesată sau a fost anulată

source: Your payment is currently being processed.
ro_ro: Plata ta este în procesare

source: Order Id
ro_ro: ID comandă

source: Detailed order status
ro_ro: Starea detaliată a comenzii

source: We have successfully received your payment
ro_ro: Plata ta a fost primită și procesată cu succes

source: There are some issues with your mobilPay Card Payment gateway configuration
ro_ro: Sunt câteva probleme cu configurația gateway-ului de plată Credit Card prin mobilPay

source: The LivePayments – mobilPay Card WooCommerce Payment Gateway plug-in requires the following plug-ins are currently missing:
ro_ro: Modulul LivePayments – mobilPay Card WooCommerce Payment Gateway depinde de următoarele module WordPress care momentan lipsesc:

source: Amount
ro_ro: Suma

source: Processed amount
ro_ro: Suma procesată

source: Actions
ro_ro: Acțiuni

source: Details
ro_ro: Detalii

source: There are no transactions matching your criteria
ro_ro: Nu există tranzacții corespunzătoare cu criteriile tale

source: Transaction details
ro_ro: Detalii tranzacție

source: Close
ro_ro: Închide

source: Card payment transaction details
ro_ro: Detalii plată tranzacție prin card

source: Client IP address
ro_ro: Adresa IP a clientului

source: Generate it for me
ro_ro: Generează pentru mine

source: The file has already been uploaded.
ro_ro: Fișierul a fost deja încărcat

source: Remove
ro_ro: Ștergere

source: Chose a file from disk
ro_ro: Alege un fișier de pe disc

source: You will be automatically redirected to the payment page in
ro_ro: Vei fi redirecționat către pagina procesatorului de plăți în

source: seconds
ro_ro: secunde

source: Pay via mobilPay&trade;
ro_ro: Plătește via mobilPay&trade;

source: The payment could not be initialized. This is usually due to an issue with the store itself, so please contact its administrator.
ro_ro: Plata nu a putut fi inițializată. Acest lucru se întâmplă de obicei din cauza unei probleme cu site-ul web, deci te rugăm să contactezi administratorul

source: Retry
ro_ro: Reîncearcă

source: System information
ro_ro: Informații sistem

source: Gateway diagnostics
ro_ro: Diagnoză gateway de plată

source: Everything appears to be functioning normally.
ro_ro: Totul pare să funcționeze corespunzător

source: The payment gateway requires further configuration until it can be used to accept payments.
ro_ro: Gateway-ul de plată nu este complet configurat pentru a putea accepta plăți.

source: Go to gateway configuration
ro_ro: Navighează la pagina de configurare a gateway-ului

source: Checkout payment workflow options
ro_ro: Opțiuni flux de plată

source: Automatically redirect customer to payment page
ro_ro: Redirecționază clientul automat către pagina externă de plată

source: Automatically redirect customer to payment page after this number of seconds
ro_ro: Redirecționază clientul automat către pagina externă de plată după acest număr de secunde

source: Do not wait, redirect immediately
ro_ro: Se redirecționează imediat

source: Save settings
ro_ro: Salvează setări

source: Diagnostics options
ro_ro: Opțiuni diagnoză

source: Monitor gateway diagnostics
ro_ro: Monitorizează starea gateway-ului de plată

source: Send gateway diagnostics warnings to this address
ro_ro: Trimite avertizările referitoare la starea gateway-ului de plată la această adresă de e-mail
